app/controllers/articles_controller.rb

	def show
	@article.update_visits_count
---
UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 1], ["updated_at", "2015-03-31 08:07:35.723955"], ["id", 14]]

	def create

	@article = current_user.articles.new(article_params)
	if @article.save
---
INSERT INTO "articles" ("title", "body", "user_id", "visits_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sakjsakjdkj"], ["body", "kjkjksjadkjdsk"], ["user_id", 1], ["visits_count", 0], ["created_at", "2015-04-03 20:39:54.720897"], ["updated_at", "2015-04-03 20:39:54.720897"]]

	def update
	if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "saass!!!"], ["updated_at", "2015-03-30 01:21:40.995355"], ["id", 7]]