app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Hola este es mi primer post"], ["user_id", 4], ["article_id", 14], ["created_at", "2015-04-07 05:12:40.415801"], ["updated_at", "2015-04-07 05:12:40.415801"]]

  def set_article
    @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 14]]